Repository: maabou512/ospo_paper2021
Catalog: LFResearch_OSPO_Report Folder/omegaT_Rainbow/pack1/pack1-level2.tmx
Source language: en_us
Languages: ja_jp

source: Clearly, OSPO advocates must become more effective at communicating the value of creating an OSPO specifically and of consuming OSS and contributing to open source communities more broadly.
ja_jp: はっきりと言えるのは、OSPO に賛同する人たちは、具体のものとして OSPO を創出することの価値、OSS を使用しオープンソース コミュニティにより広くコントリビュートすることの価値について、より効果的に伝えなければならない、ということです。

source: Clearly, open source has ascended from a method and a mindset for building technology products and infrastructure to a means of attracting top talent and achieving business goals.
ja_jp: 明らかに、オープンソースは、技術製品やインフラを構築するための「手法（Method)」や「マインドセット」といったところから、トップタレントを惹きつけ、ビジネスゴールを達成する「手段（Means）」といった地点へと登ってきたのです。

source: Closely related and often overlapping with open source first archetypes, this OSPO archetype plays a key role in evaluating viable open source technologies and helping the organization’s CTO and vice president of engineering to lay out a technology roadmap.
ja_jp: 「オープンソース ファースト」の原型に関連し、しばしば部分的に重なるこの OSPO の原型は、実効性があるオープンソースの技術を評価し、組織の CTO とエンジニアリング担当VPが技術ロードマップを策定するのを支援する、重要な役割を担います。

source: Cloud Native Landscape
ja_jp: クラウドネイティブ ランドスケープ

source: Comcast encourages its software engineers to contribute back to open source projects and to upstream changes they make to open source they consume.
ja_jp: Comcast は、同社ソフトウェア エンジニアたちに対し、オープンソース プロジェクトへ還元的にコントリビュートすることや、使用しているオープンソースの修正をアップストリームへ反映することを奨励しています。

source: Comcast entered its next phase of the maturity cycle a few years later, when the company began to incubate and release projects to the public, starting with Apache Traffic Control.
ja_jp: 数年後、同社は成熟サイクルの次のフェーズに入り、Apache Traffic Control を皮切りに、プロジェクトのインキュベーションや公開リリースを開始しました。

source: Comcast has contributed some major open source projects to the open source community, including the Apache Traffic Control, a large-scale content delivery network solution in production at Comcast to deliver last-mile content to customers.
ja_jp: Comcast は、Apache Traffic Control を含むいくつかの主要なオープンソース プロジェクトをオープンソース コミュニティへコントリビュートしてきました。その中には顧客へのラストワンマイルのコンテンツ配信をするために、同社で稼働中の大規模コンテンツデリバリ ネットワーク ソリューションの Apache Traffic Control が含まれています。

source: Comcast incubated the Apache Traffic Control Project
ja_jp: Apache Traffic Control プロジェクトをインキューベートしたComcast

source: Comcast is a global media and technology company that has embraced open source across its organization.
ja_jp: Comcast は、グローバルなメディア企業であり、かつ組織全体でオープンソースを採用してきたテック企業でもあります。

source: Comcast moved to the contribution stage of the OSPO maturity cycle soon after, when company developers began to contribute code to open source projects and Comcast established an Open Source Advisory Council.
ja_jp: Comcast は、その後すぐにOSPO成熟サイクルの「コントリビューション」の段階に移行し、このときに自社開発者たちがオープンソース プロジェクトにコードをコントリビューションし始め、同社は「オープンソース諮問評議会（Open Source Advisory Council）」を設立しました。

source: Comcast supports the collective development ethos underlying open source ecosystems.
ja_jp: また Comcast は、オープンソースエコシステムの根底にある「コレクティブな」開発の風土をサポートしています。

source: Comcast took an inventory of OSS usage and dependencies early in starting the OSPO to understand better where the dependencies were and communities to support and work with.
ja_jp: OSPO を開始した当初、Comcast では OSS の使用状況や依存関係のインベントリを作成し、その依存関係がどこにあり、サポート・連携すべきコミュニティはどこなのか、といったことについて理解が深まっていきました。

source: Comcast understands the power of global open source collaboration and innovation and it is a vital tool for working on its customer experience and to attract the best talent to the company.
ja_jp: Comcast は、グローバルなオープンソースのコラボレーションやイノベーションの力を理解していて、そしてそれがカスタマー エクスペリエンスの向上や、最高の人材を自社へ惹きつける、重要なツールであることも理解しています。

source: Comcast ’s involvement in open source officially began in 2006, when a software developer made a patch contribution to Apache HTTP and demonstrated that fixing a project upstream was easier than maintaining patches at the consumption level.
ja_jp: Comcast のオープンソースへの関与は、公式には2006年に始まりました。この年、一人のソフトウェア開発者が Apache HTTP へのパッチ コントリビューションを行い、使用者が個別パッチをメンテナンスするよりも、プロジェクトのアップストリームで修正する方がより負担が小さいことを実演してみせました。

source: Communicate to employees and managers the importance of contributing to and not merely consuming OSS (including advocating for and driving event sponsorships, booking project leads and maintainers as speakers or panelists in public coding forums, and securing organizational resources to mission-critical OSS projects)
ja_jp: 単に OSS を消費するのではなく、OSS にコントリビュートすることの重要性を社員やマネージャに伝える（イベントのスポンサーシップの提唱・推進、公の場のコーディングフォーラムでプロジェクトリーダーやメンテナーを登壇者、パネリストとして参加してもらうための調整、ミッションクリティカルな OSS プロジェクトへの組織内リソースの確保、などを含む）

source: Companies such as PayPal and Comcast have active inner source programs and inner source evangelists.
ja_jp: PayPal や Comcast などの企業には、活発なインナーソース プログラムがあり、活動的なインナーソース エバンジェリストも存在しています。

source: Company Profiles
ja_jp: 各社プロフィール

source: Compared to 2019, a few trends emerged in the perception of OSPO roles, priorities, and values.
ja_jp: 2019年と比較すると、OSPOの役割、優先事項、価値に対する認識にはいくつかのトレンドが見えてきました。

source: Conclusion: The Future of the OSPO
ja_jp: まとめ：OSPOの将来

source: Conclusion: The Future of the OSPO 29
ja_jp: まとめ：OSPOの将来 29

source: Consequently, the organization has neither a centralized team focused on open source nor a top-level open source strategy for the organization.
ja_jp: その結果として、その組織にはオープンソースに焦点を当てた中核的チームも、組織にとってのトップレベルのオープンソース戦略も存在していません。

source: Consider Microsoft, an organization that once focused almost exclusively on proprietary software but has become a leading supporter of open source projects and an extensive user of OSS for its own products.
ja_jp: Microsoft について考えてみましょう。かつてはほとんど排他的にプロプライエタリなソフトウェアに焦点を当てていましたが、今やオープンソース プロジェクトの主要な支持者となり、自社製品のための広範な OSS ユーザーとなっています。

source: Consider VMware, an enterprise infrastructure software provider.
ja_jp: エンタープライズ向けのインフラソフトウェア プロバイダである、VMware について考えてみましょう。

source: Contents
ja_jp: 目次

source: Continued development of the code and growth of the community both require considerable work with time and monetary investments.
ja_jp: コードの継続的開発とコミュニティの成長、どちらも多くの時間的、金銭的投資が要求されます。

source: Copyright © 2022 TODO Group | February 2022 This report is licensed under the Creative Commons Attribution-NoDerivatives 4.0 International Public License
ja_jp: Copyright(C)2022 TODO Group February 2022 本レポートは、Creative Commons Attribution-NoDerivatives 4move through.0 International Public License の下で許諾されています。

source: Create and launch open source projects to establish broad credibility in the open source community
ja_jp: オープンソース コミュニティでの幅広い信頼を確立するべくオープンソース プロジェクトを創出し、立ち上げる

source: Create education programs to help developers decide when to use OSS in creating new products or services
ja_jp: 開発者たちが新しい製品、サービスを作るにあたり、OSS を利用する際の判断材料となる教育プログラムを作成する

source: Creating internal frameworks and tools for effective and efficient consumption of open source project code
ja_jp: オープンソース プロジェクトのソースコードを効果的かつ効率的に利用するための内部フレームワークやツールの作成

source: Cross- Industry Collaborative
ja_jp: 業界 「横断」で協調的

source: Cross-Industry Collaborative
ja_jp: 業界「横断」で協調的

source: Cross-Industry Collaborative 19
ja_jp: 業界「横断」で協調的 19

source: DND
ja_jp: 非公開

source: Deborah Bryant (Senior Director, Open Source, Red Hat), Zoom interview with author, Aug.
ja_jp: Deborah Bryant（Red Hat、オープンソース担当シニアディレクター）、著者による Zoom インタビュー、

source: Dedicate one or more full-time employee(s) to a project, and accept responsibility for nurturing a project community and ensuring its health
ja_jp: プロジェクトに1人以上のフルタイムの社員をアサインし、プロジェクトのコミュニティを育み、その健全性を確保する責任を負う

source: Define program branding (e.g., OSPO, open source initiative, head of open source operations)
ja_jp: オープンソース コンプライアンスプログラムのブランディングを行う（例：「OSPO」、「Open Source Initiative」、「オープンソースの運用責任者」といった認知してもらう統一的名称を作成する）

source: Demand for open source and OSPO services appears to outstrip supply, and more mature OSPOs are developing scaling processes and capabilities to serve a broader user base inside these organizations.
ja_jp: オープンソースや OSPO サービスに対する需要は供給を上回っているようであり、より成熟した OSPO は、これらの組織内のより幅広い「ユーザーベース」に対して機能するべく、スケールするプロセスやケイパビリティを発展させています。

source: Description
ja_jp: 説明

source: Detailed collection
ja_jp: 詳細に収集

source: Develop internal processes, playbooks, checklists, tooling, and other mechanisms to vet, organize, and operate open source projects and to prepare and coach their leaders
ja_jp: オープンソース プロジェクトを調査し、構造化し、運営し、さらにプロジェクト リーダーをコーチし、備えのできた状態になってもらうよう、社内プロセス、プレイブック、チェックリスト、ツール、その他の仕組みを整備する

source: Developers also frequently adopt OSS development tools such as integrated development environments (IDEs), or tools built on top of open source like GitHub and GitLab.
ja_jp: 開発者たちはまた、OSS の開発ツール ― 統合開発環境（IDE）や、GitHub、GitLab のようにオープンソースの上で構築されたツール類 ― をよく採用しています。

source: Developers may deploy OSS ad hoc without cataloging their efforts systematically.
ja_jp: 開発者たちは、自らの取り組みをシステマチックにカタログ化することなく、アドホックに OSS デプロイしているかもしれません。

source: Developers may use OSS for rapid prototyping or for microservices and small applications.
ja_jp: 開発者たちが、ラピッドプロトタイピングやマイクロサービス、小さなアプリケーションのために OSS を使っているかもしれません。

source: Dirk Riehle (Professor, OSS, Friedrich-Alexander University Erlangen-Nürnberg), Zoom interview with author, Sept.
ja_jp: Dirk Riehle（Friedrich-Alexander University-Alexander University Erlangen-Nürnberg）、著者による Zoom インタビュー、

source: Disclaimer
ja_jp: 免責事項（Disclaimer）

source: Disclaimer 31
ja_jp: 免責事項 31

source: Discover more about all the ongoing TODO Initiatives here and check out the OSPO landscape: https://landscape.todogroup.org
ja_jp: 現在進行中のすべての「TODO イニシアチブ（TODO Initiative）」の詳細については、こちら を、「OSPO ランドスケープ（OSPO Landscape）」についてはこちらで確認ください：https://landscape.todogroup.org （リンク先はいずれも英語）

source: Does it look like a real community, or is it being run by a single company or individual?
ja_jp: 「それが本来の意味でのコミュニティのように見えるか、それとも単一の企業や個人によって運営されているのか?」

source: Does one party (company or organization) or a whole community control the project?
ja_jp: そのプロジェクトをコントロールしているのは、1つ（企業や組織）なのか、コミュニティ全体なのか?

source: During this stage, the organization strengthens its collaborative muscle and experiences the social life of an OSS project and community.
ja_jp: このステージの間、組織は自らのコラボレーションの「筋肉」を鍛え、OSS プロジェクトやコミュニティの「社会生活」を経験することになります。

source: During this stage, we tend to see rapid growth in the OSPO.
ja_jp: このステージの段階で、OSPO における急速な成長が観察される傾向があります。

source: During those early days, Peters and other Porsche OSS leaders spent time talking to leading software and technology companies with long open source track records, such as SAP, to learn about how they handled and nurtured open source.
ja_jp: 立ち上げ当初は、Peters をはじめとする Porsche のOSSのリーダーたちは、オープンソースに関し長きにわたる実績を持つ主要なソフトウェアおよびテック企業である SAP のような企業との対話に時間をかけ、彼らがどのようにオープンソースを扱い、育んだかを学びました。

source: Eager to work on foundational technology problems that cross industries.
ja_jp: 業界横断する根本的な技術課題に熱心に取り組もうとする

source: Early and prominent contributors to the JavaScript and Node.js communities, key Bloomberg employees were already immersed in open source.
ja_jp: 当初 JavaScript と Node.js コミュニティへの際立ったコントリビューターだった、主要な社員たちは、すでにオープンソースへ没頭していました。

source: Echoing many of the TODO Group’s best practices, Fleming customized the handbook to Bloomberg and its specific internal processes and decision-making practices.
ja_jp: TODO グループの多くのベストプラクティスに倣い、Fleming はそのハンドブックを Bloomberg 用としてカスタマイズし、また具体的社内プロセスや意思決定実務用にもカスタマイズを行いました。

source: Educating Developers
ja_jp: 開発者たちを教育する

source: Employee education includes laying out best practices in interacting with OSS projects such as how to request features, file bug reports, and contribute basic code.
ja_jp: 社員教育では、OSS プロジェクトとの連携で得られたベストプラクティス ― 機能実装の要求の仕方、バグレポートの出し方、基本コードのコントリビューションの仕方など ― について説明されることもあります。

source: Employees are tasked with fostering and nurturing OSS usage.
ja_jp: 社員が、OSS の使用を促進され、教育されたもとで業務遂行している

source: Engaging with developer communities as a primary responsibility rose from 48% to 56%.
ja_jp: 一方で開発者コミュニティにエンゲージすることを主な責務、とした回答は48%から56%に上昇しました。

source: Enterprises realized they needed to accommodate this new way of innovating or risk falling behind.
ja_jp: 企業は、この新しいイノベーションのやり方に対応する必要があること、あるいは遅れをとってしまうリスクがあることに気づきました。

source: Equally instructive are detailed examinations of the formation, organization, and utilization of OSPOs through interviews and case studies.
ja_jp: 同様に、OSPO の形成、組織、活用に関するインタビューやケーススタディを通じ、詳細レベルを捉え調査していくことで知見を得ることもできるでしょう。

source: Evaluating open source projects and providing strategic guidance on the risks and rewards of adopting projects into the organization’s long-term technology plans, with a focus on developer experience and efficiency
ja_jp: オープンソース プロジェクトの評価および、プロジェクト採用のリスクや報酬に関する戦略的ガイダンスの提供。開発者の経験値や効率性に重点を置き、組織の技術的な長期計画に照らし合わせたガイダンスを提供する

source: Even from inception, the group’s vision of creating a Porsche open source ecosystem involved grander and more holistic goals.
ja_jp: その始まりから、 「Porsche のオープンソース エコシステムを構築する」というグループのビジョンには、壮大で全体感のある目標が伴っていました。

source: Even so, the OSPO movement has room to grow.
ja_jp: それでも、OSPO の動きにはまだまだ成長の余地があります。

source: Example
ja_jp: 例

source: Executive Summary
ja_jp: エグゼクティブ サマリー

source: Executive Summary 5
ja_jp: エグゼクティブ サマリー 5

source: Executives recognize that OSS and open source more broadly are important strategic assets.
ja_jp: エグゼクティブたちが、OSS および、より広い意味での「オープンソース」が重要な戦略的資産であることを認識している

source: Explains Ruff, “Our business units now come to us with ideas and say, ‘Hey, here’s what we want to do.
ja_jp: Ruff は次のように説明しています。「私たちのビジネスユニットから、アイデアの持ち込みくるようになり、来た人はこんなことを言うのです。『やぁ。こういうことをやってみたいんだけど。

source: February 2022
ja_jp: 2022年2月

source: Figure 1
ja_jp: 図1

source: Figure 2
ja_jp: 図2

source: Figure 3
ja_jp: 図3

source: Figure 4
ja_jp: 図4

source: First, the OSPO advises the CTO and technology leadership on which open source technologies to adopt or remove from the organization’s technology stack.
ja_jp: 第1に、OSPOは、CTOと技術リーダーに対して、自組織の技術スタックからどのオーンソース技術を採用または除去すべきか、について助言します。

source: Fleming explained:
ja_jp: Fleming はこう説明します。

source: Fleming said,
ja_jp: Fleming は言います。

source: Fleming told us that Bloomberg regularly collaborates with open source companies to help them understand what sorts of behaviors and governance structures they need to cement longer-term commitments for use of their software.
ja_jp: Fleming によると、Bloomberg はオープンソース企業と定期的に連携しているそうです。彼らのソフトウェアを使うことに対する長期的コミットメントを確固たるものにするために、どんなガバナンス構造や振る舞いが彼らに必要なのか？といったことを彼らに理解してもらえるようにしているのです。

source: For example, Bloomberg technologists have collaborated with other organizations to create independent open source projects and thriving communities such as the KServe project for easier use of common machine learning software and model serving on Kubernetes.
ja_jp: 例えば、同社の技術者たちは、独立したオープンソース プロジェクトや、KServe プロジェクトt ― Kubernetes上で共通的な機械学習ソフトウェアやモデルをより使いやすくする ― のような活発なコミュニティを作り上げるために他の組織とコラボレーションしてきました。

source: For example, Comcast incubated the Apache Traffic Control Project, which is a top-level project in the Apache Foundation.
ja_jp: 例えば、Comcast は Apache Foundation のトップレベル プロジェクトである Apache Traffic Control Project をインキュベートしました。

source: For example, Porsche has collaborated with a number of other industry players to work on the OSS Review Toolkit, an orchestration toolchain that automates and standardizes compliance and reporting of OSS.
ja_jp: 例えば、Porsche は他の多くの業界関係者と協力して、「OSS Review Toolkit 」 ― OSSのコンプライアンスやレポーティングの自動化、標準化を行う一連のオーケストレーション ツール ― に取り組んでいます。

source: For example, both Comcast and Bloomberg have employees working full-time on OSS projects.
ja_jp: 例えば、Comcast と Bloomberg の両社は OSS プロジェクトに取り組む、フルタイムの従業員がいます。

source: For example, disclosure rules of OSS projects tend to be stricter than those of proprietary projects.
ja_jp: 例えば、OSS プロジェクトのディスクロージャー ルールは、プロプライエタリなプロジェクトよりも厳しい傾向にあります。

source: For example, software and technology companies dominate the core development team of the Linux Project.
ja_jp: たとえば、ソフトウェア企業やテック企業は、Linux プロジェクトのコア開発チームの大半を占めています。

source: For example, to become more collaborative, Comcast joined the Linux and Apache Foundations and began to seek leadership roles in those bodies and to attend more events.
ja_jp: 例えば、よりコラボレーティブになるために、Comcast はLinux Foundation と Apache Foundation に参加し、これらの団体でリーダー的役割を模索し、より多くのイベントに参加するようになりました。

source: For example, when Fleming arrived at Bloomberg, company engineers did not speak about their work on open source at technology conferences.
ja_jp: たとえば、Fleming が Bloomberg にきたとき、同社エンジニアたちが技術カンファレンスでオープンソースにおける自身の業務について話すことはありませんでした。

source: For large non-tech companies, compliance remained the most cited primary responsibility, at 86%.
ja_jp: 非テック系の大企業では、ライセンス コンプライアンスを主な責務とすることが依然として最も多く挙げられ、86%の割合を占めました。

source: For most other companies in our study, the general stages of the maturity model closely map the organizational OSS trajectories in terms of consumption, contribution, collaboration and participation, and leadership.
ja_jp: 成熟度モデルと総体的な段階は、私たちが調査したその他ほとんどの企業について組織的なOSSの軌跡 ― 「消費（Consume）」、「コントリビューション（Contribution）」、「コラボレーション（Collaboration）と参加（Participation）」そして「リーダーシップ（Leadership）」の観点での軌跡 ― をはっきりと描いています。

source: For organizations, active and visible participation yields multiple benefits: better visibility, better reputation, more attractive employer. To this end, many non-tech organizations purchase booths at prominent OSS events to interact more with those communities and recruit developers who enjoy working in OSS ecosystems.
ja_jp: また、組織にとって積極的で目に見える参加が、可視性を高め、評判を上げ、雇い主の魅力を上げる、といった多重の恩恵を生み出すものとなります。非テック組織の多くは、この目的のために際立った OSS イベントのブースを購入し、コミュニティとの交流を深め、OSS エコシステムの中で働くことを楽しむ開発者たちを採用するのです。

source: For this paper, we interviewed OSPO leaders primarily working at large enterprises headquartered in North America, the European Union, and Asia.
ja_jp: 本書の執筆にあたり、北米、EU（欧州連合）、およびアジアに本社を置く大企業を主とした OSPO のリーダーたちにインタビューを行いました。

source: For this reason, most OSPOs do not seek to launch big projects from their organizations.
ja_jp: この理由から、ほとんどの OSPO は自組織から大きなプロジェクトを立ち上げようとはしません。

source: Foreword
ja_jp: 前書き

source: Foreword 3
ja_jp: 前書き 3

source: Foster greater collaboration with industry and other technology leaders
ja_jp: 業界およびその他のテクノロジー リーダーたちとより意義のあるコラボレーションを育むこと

source: Founded in 2021, Linux Foundation Research explores the growing scale of open source collaboration, providing insight into emerging technology trends, best practices, and the global impact of open source projects.
ja_jp: 2021年に設立された Linux Foundation Research は、規模の拡大するオープンソースコラボレーションを対象とし、オープンソースプロジェクトにおける新たな技術トレンド、ベストプラクティス、グローバルな影響に対し洞察（Insight）を加える調査活動をしています。

source: Four Stages of the OSPO
ja_jp: OSPO の4つのステージ

source: From June 10 to June 29, 2021, the TODO Group, in partnership with Linux Foundation Research and the New Stack, conducted a survey to better understand OSPO formation, operation, and evolution.
ja_jp: TODO グループは、2021年6月10日から29日にかけ、Linux Foundation Research および New Stack の協力のもと、OSPO の形成、運用および進化について理解を深めるべく、調査を実施しました。

source: Further, Bloomberg’s OSPO has helped the company establish an open policy prioritizing community-based open source technologies with independent governance and vibrant, diverse memberships.
ja_jp: さらに、Bloomberg の OSPO は、社内「オープンポリシー」 ― 独立したガバナンスや活発で多様なメンバーを有したコミュニティベースのオープンソース技術を優先するポリシー ― の策定を支援してきました。

source: Furthermore, OSPOs are more than just for the tech industry; we are seeing OSPOs being established within academia and governments to help with software procurement and innovation.
ja_jp: さらに、OSPO はテクノロジー産業だけのものではなく、ソフトウェアの調達やイノベーションの支援を目的に、アカデミアや政府機関でも OSPO を設立しているところもあります。

source: Given the many OSS options today—with most major categories of software featuring dozens of choices, as shown in Figure 3—the OSPO can provide insights into OSS trends, such as popularity of different languages, designs of APIs, or capabilities of different NoSQL databases.
ja_jp: 図3に示すように、今日の多くの OSS オプション ― ほとんどの主要なソフトウェア カテゴリは何十も選択肢があります ― を考えると、OSPO は開発言語の人気、API の設計、各種 NoSQL データベースの能力といった、OSS のトレンドに関する洞察を提供することができます。

source: He added:
ja_jp: さらに彼は付け加えます。

source: He had served as an engineering leader at small companies with significant open source project exposure, up to maintaining and growing entire projects.
ja_jp: これまで彼はオープンソース プロジェクト全体の維持や成長に至るまで、重要なオープンソース プロジェクトに関わっていた小さな企業でエンジニアリング リーダーを務めていました。

source: Help organizations understand and navigate project politics
ja_jp: 組織がプロジェクトの「政治（Polictics）」を理解し、その上で前進できるよう支援する

source: Helping the company and its technology teams to prioritize OSS consumption and make open source the first choice by default for any technology initiative
ja_jp: 企業やその技術チームがOSSの使用を優先し、あらゆる技術的イニシアチブにおいてオープンソースを最初に選択できるよう支援する

source: Historically, Porsche has consumed open source software for niche capabilities.
ja_jp: 歴史的に、Porsche ではニッチなケイパビリティのためにオープンソース ソフトウェアを使用してきました。

source: How do we put this in a foundation?
ja_jp: これを財団でホストしてもらうにはどうしたらよいの？

source: How frequently does the project ship new versions?
ja_jp: どのくらいの頻度で新しいバージョンをリリースしているか？

source: How has that number changed over time?
ja_jp: こういった数字が時間の経過とともにどのように変化してきたか?

source: How long does it take to respond to pull requests or bug filings?
ja_jp: プルリクエストやバグ報告に対応するのに、どれくらいの時間がかかっているか？

source: How many contributors does the project have?
ja_jp: プロジェクトに何人のコントリビューターがいるのか？

source: How they adopt and initially use it varies.
ja_jp: OSS の採用の仕方や初期段階での使い方はさまざまです。

source: However, as a rule, inner source software is usually proprietary, not intended for publication via an open source license.
ja_jp: だだし原則として、インナーソース ソフトウェアは通常プロプライエタリなものであり、オープンソース ライセンスによる公開を意図したものとはなっていません。

source: However, the very earliest form of adoption is ad hoc, by developers solving problems using readily available tools and technologies.
ja_jp: しかし、非常に初期の段階での導入形態は場当たり的（アドホック）なもので、すぐに使えるツールや技術を開発者たちが駆使しながら、問題を解決します。

source: I once walked into a company, and one developer said: We have no open source policy.
ja_jp: 私はある企業に足を踏み入れたことがありますが、そこである開発者がこんなことを言ったのです：「うちにはオープンソースポリシーなんてないよ。」

source: IBM initially called its programmatic open source efforts the “Open Source Steering Committee,” for example.
ja_jp: たとえば IBM では、当初自社のオープンソースの活動主体を「オープンソース運営委員会（Open Source Steering Committee）」と呼んでいました。

source: If we are going to choose these [OSS] tools to replace vendor-provided tools, how do we put ourselves on a path to be a productive member of the community, and not be an organization that takes releases and deploys them, but wonders, “How we will get support when we need to get changes made or answer questions?”
ja_jp: ベンダーが提供しているツールの置き換えのためにこれらの OSS ツールを選択するのだとすれば、どのようにして生産性の高いメンバとしてその OSS コミュニティに身を置き、（単に）リリースを取得してデプロイするような組織ではなく、「変更を加えたり、問い合わせに応える必要があるときに、コミュニティからどうサポートを得られるのか?」といった疑問を抱くような組織になるには、どうすればいいでしょうか?

source: Improve software quality and security
ja_jp: ソフトウェアの品質とセキュリティを向上させること

source: Improving Porsche’s reputation as a software organization in the open source development community
ja_jp: オープンソース開発コミュニティの中のソフトウェア企業としての Porsche の評判を上げること

source: In 2020, Porsche officially launched its OSPO.
ja_jp: 2020年、Porsche は 正式に OSPO を立ち上げました。

source: In June 2021, Bloomberg added a second FTE to the OSPO, Alyssa Wright, who has a deep background in OSS, including board leadership at OpenStreetMap.
ja_jp: 2021年6月、Bloomberg の OSPO に2人目のフルタイムメンバとして OpenStreetMap のボードでのリーダーシップを含め、OSS の深いバックグラウンドをもつ、Alyssa Wright が加わりました。

source: In Stage 3, organizational leaders support incubating and launching open source projects into the public sphere because they understand how these projects benefit their organization.
ja_jp: ステージ3の段階では、組織のリーダーたちがオープンソース プロジェクトのインキュベーションやパブリックな領域への立ち上げをサポートします。これは、オープンソースプロジェクトが組織にとってどのようなメリットがあるのかを理解しているからです。

source: In a recent study by the Linux Foundation Research of the financial services industry, 53% of contributors said they contributed to OSS because “it’s fun.”
ja_jp: Linux Foundation Research による最近の金融サービス業界に関する調査 では、コントリビューターの 53% が OSS 貢献した理由を「楽しいから（It's fun）」だと答えています。

source: In a second type of strategic guidance, OSPOs take the lead on benchmarking what constitutes an acceptable OSS project.
ja_jp: 第2のタイプの戦略的ガイダンスとしては、OSPO が主導し、「受け入れ可能」となっている OSS プロジェクトの構成要素に対しベンチマークを行います。
